Repository: SakerDakak/ur-fit
Catalog: lib/core/presentation/localization/app_*.arb
Languages: ar

# infoUpdatedSuccessfully
source: Information updated successfully
ar: تم تحديث المعلومات بنجاح

source: Injuries or Diseases
ar: إصابات أو أمراض

# doYouHaveCurrentlyAnyPainOrInjury
source: Do you currently have any pain or injury?
ar: هل تعاني حاليا من اي الم او اصابة في جسمك

# inWhichBodyPartYouFeelPainOrHaveInjury
source: In which body part do you feel pain or have injury?
ar: في أي جزء من الجسم تشعر بالألم أو لديك إصابة؟

source: Back
ar: الظهر

source: Cardiac Disease
ar: امراض القلب

source: Chest
ar: الصدر

source: Lower Arms
ar: الذراعين السفليتين

source: Lower Legs
ar: الساقين السفليتين

source: Neck
ar: الرقبة

source: Shoulders
ar: الأكتاف

source: Upper Arms
ar: الذراعين العلويتين

source: Upper Legs
ar: الساقين العلويتين

source: Waist
ar: الخصر

source: Current BMI
ar: BMI الحالي

source: Target BMI
ar: BMI المستهدف

source: BMI
ar: مؤشر كتلة الجسم (BMI - Body Mass Index)

# bmiDescription
source: A number calculated from your height and weight to estimate body fat and assess if youâ€™re underweight, normal, overweight, or obese.
ar: رقم يتم حسابه من طولك ووزنك لتقدير نسبة الدهون في الجسم وتقييم ما إذا كان وزنك طبيعي او تعاني من نقص الوزن أو زيادة الوزن أو السمنة.

source: Guide
ar: دليل

source: Below
ar: أقل من

source: and above
ar: او اكثر

source: Underweight
ar: نقص الوزن

source: Normal weight
ar: وزن طبيعي

source: Overweight
ar: زيادة الوزن

source: Obesity
ar: سمنة

# excerciseLocation
source: Exercise Location
ar: مكان التمرين

source: My Tasks
ar: مهامي

source: Price
ar: السعر

source: Unselect All
ar: إلغاء تحديد الكل

# subscriptionMethodWillBeSentToYourMail
source: Subscription method will be sent to your email
ar: سيتم إرسال طريقة الاشتراك في البريد الإلكتروني

# trialPeriodEnded
source: Trial period has ended
ar: انتهت فترة التجربة

source: Please check your internet connection
ar: رجاء التحقق من اتصالك بالانترنت

source: No internet connection
ar: لا يوجد اتصال بالانترنت

source: Something went wrong
ar: حدث خطأ ما

source: Edit Weight
ar: تحديث الوزن

source: Liters
ar: لتر

source: No Workout Today
ar: لا يوجد تمرين لهذا اليوم

source: Next Exercise
ar: الانتقال للتمرين التالي

source: Finish Exercise
ar: انهاء التمرين

# youHaveToSubscripeToAccessThisFeature
source: You have to subscribe to access this feature
ar: يجب عليك الاشتراك للوصول لهذه الميزة

source: Select Meal
ar: اختيار الوجبه

source: Please enter the verification code sent to your email
ar: رجاء ادخال رمز التحقق الذى تم ارساله على البريد الالكترونى

source: No Previous Plan
ar: لا يوجد بيانات

source: Programs
ar: برامج

# specifiedNutrationPlansForYourBody
source: Specified Nutrition Plans For Your Body
ar: برامج غذائية متكاملة مخصصة لاحتياجات جسمك

source: Categories
ar: الاقسام

source: Following daily tasks increase your chances to
ar: القيام بالمهام اليومية يزيد من فرصك في

source: Reach perfect body
ar: الوصول للجسم المثالي

source: Oatmeal
ar: دقيق الشوفان

source: Eggs
ar: بيض

source: Vegetables
ar: خضروات

source: Fruits
ar: فاكهة

source: Salads
ar: سلطات

source: Soups
ar: شوربات

source: Grilled Foods
ar: مشويات

source: Poultry
ar: دواجن

source: Complicated Preparation
ar: تحضير معقد

source: Easy Preparation
ar: تحضير سهل

source: Medium Preparation
ar: تحضير متوسط

source: Search Result
ar: نتائج البحث

# mealPreperation
source: Meal Preparation
ar: تحضير الوجبة

source: Meal Components
ar: مكونات الوجبة

source: Meal Preparation Time
ar: مدة تحضير الوجبة

source: Meal Category
ar: نوع الوجبة

source: Filter
ar: تصفية

source: Meal Details
ar: تفاصيل الوجبة

source: Show Less
ar: عرض أقل

source: Show More
ar: عرض المزيد

source: Meal Description
ar: وصف الوجبة

# todayEcerciseFocusOn
source: Today's exercise focuses on
ar: تمرين اليوم يركز على

source: Best Offer
ar: أفضل عرض

source: First
ar: الأول

source: Second
ar: الثاني

source: Third
ar: الثالث

source: Fourth
ar: الرابع

source: Fifth
ar: الخامس

source: Sixth
ar: السادس

source: Seventh
ar: السابع

source: Eighth
ar: الثامن

source: Ninth
ar: التاسع

source: Tenth
ar: العاشر

# finaly
source: Finally
ar: أخيرا

source: Loading
ar: جارى التحميل

# excerciseDescription
source: Exercise Description
ar: وصف التمرين

source: Instructions
ar: تعليمات

source: Group
ar: مجموعة

source: Groups
ar: المجموعات

source: Expected Burned Calories
ar: السعرات الحرارية المتوقعة للحرق

source: Train Description
ar: وصف التمرين

# currentWeightIs
source: Your current weight is
ar: وزنك الحالي هو

# caloriesBurn
source: Calories burned
ar: سعرات حرارية حرق

# detailsOfTodayExercises
source: Details of today's exercises
ar: تفاصيل تمارين اليوم

# excerciseDuration
source: Exercise duration
ar: مدة التمرين

source: Minutes
ar: دقائق

source: You are subscribed to a plan
ar: انت مشترك في خطة

source: Please make sure that you selected all the required fields
ar: رجاء التأكد من اختيارك لكل الحقول المطلوبة

# couponIsInValid
source: This coupon is invalid
ar: هذا الكوبون غير صالح

source: Google authentication failed
ar: فشل في التحقق من جوجل

source: Email not found
ar: الايميل غير موجود

source: Invalid verification code
ar: كود التحقق غير صحيح

# youHaveSuccessfullySubscribedToPlan
source: You have successfully subscribed to the plan
ar: تم الاشتراك في الخطة بنجاح

source: Retry
ar: إعادة المحاولة

# pleaseEnterValidAge
source: Please enter a valid age
ar: رجاء ادخال سن صحيح

# pleaseEnterValidHeight
source: Please enter a valid height
ar: رجاء ادخال طول صحيح

# pleaseEnterValidWeight
source: Please enter a valid weight
ar: رجاء ادخال وزن صحيح

source: Your Health
ar: صحتك

source: is more important than anything
ar: اهم من كل شئ

# welconeToMyDailyCompanionToAHealthyLife
source: Welcome to my daily companion to a healthy life
ar: مرحبًا بك في رفيقي اليومي لحياة صحية

# onboardingParagraphOne
source: Did you know that small steps every day make a difference? We are here to help you track your health, sleep better, and live with more energy!
ar: هل تعلم ان خطوات صغيرة كل يوم تصنع فرقا نحن هنا نساعدك تتابع صحتك ,تنام افضل ,وتعيش بطاقة اعلى !

source: Start your health journey today
ar: ابدأ رحلتك الصحية اليوم

source: Move
ar: حرك

source: Your body to free your power
ar: جسمك حرر طاقتك

# youDontNeedClub
source: You don't need a club
ar: ما تحتاج نادى

source: You need to start
ar: تحتاج تبدأ

# onboardingParagraphTwo
source: With us, you can exercise at home, at your own time, with daily workouts, smart reminders, and fun challenges waiting for you!
ar: معانا تقدر تحرك فى بيتك,فى وقتك المناسب, تمارين يومية ,تذكيرات ذكية وتحديات ممتعة بانتظارك !

# everyMpementsGetYouCloserToYourGoal
source: Every movement gets you closer to your goal
ar: كل حركة تقربك لهدفك

source: Eat
ar: كل

source: right, live right
ar: صح تعيش صح

source: Say goodbye to confusion and receive healthy, delicious meals
ar: ودعً الحيرة واستقبل وجبات صحية لذيذة

# onboardingParagraphThree
source: And plan your meals, track your calories, and discover smart alternatives, because healthy eating doesn't mean deprivation, but balance and intelligence.
ar: وخطط وجباتك ,احسب سعراتك و اكتشف البدائل الذكية ,لان الاكل الصحى مايعنى الحرمان,بل توازن وذكاء

source: Resend after
ar: اعادة الارسال بعد

source: Seconds
ar: ثانية

# otpHasBeenSentToYourEmail
source: An OTP has been sent to your email
ar: تم ارسال رمز التحقق الي بريدك الالكترونى

source: Press double back to exit
ar: اضغط مرتين للخروج

source: This field is required.
ar: هذا الحقل مطلوب.

# passwordLengthError
source: Password must be at least 6 characters long.
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل.

# invalidEmail
source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح.

# valueMustBeNum
source: {val} must be at least {num} characters
ar: قيمة {val} يجب أن تكون {num} أو أكثر.

# invalidPhoneNumber
source: Please enter a valid phone number.
ar: يرجى إدخال رقم هاتف صالح.

# app_name
source: URFIT
ar: يورفيت

# onBording1Title
source: plan customized for you to reach your goal
ar: خطة مخصصة لك للوصول لهدفك

# onBording1Body
source: Exciting and easy
ar: بكل متعة وسهولة

# startYourTrip
source: Start your journey
ar: ابدا رحلتك

# chooseLang
source: Choose language
ar: اختر اللغة

# chooseCountry
source: Choose your country
ar: اختر دولتك

# chooseCity
source: Choose your city
ar: اختر مدينتك

# continuee
source: Continue
ar: استمرار

source: Signup
ar: انشاء حساب

source: SignIn
ar: تسجيل دخول

source: Email
ar: البريد الالكترونى

# enterEmail
source: Enter your Email
ar: ادخل البريد الالكترونى

source: Password
ar: كلمة المرور

# enterPassword
source: Enter your password
ar: ادخل كلمة المرور

source: Forget Password
ar: نسيت كلمة المرور

source: Remember me
ar: تذكرنى

source: Or
ar: او

# youCanLogInAs
source: Sign In As
ar: يمكنك الدخول

source: Guest
ar: كزائر

source: Full name
ar: الاسم كامل

# enterFullName
source: Enter your full name
ar: رجاء ادخال الاسم كاملا

source: Confirm password
ar: تاكيد كلمة المرور

# agreeTerms
source: Agree to terms and conditions
ar: اوافق على الشروط والاحكام

# registerNewAccount
source: Create New Account
ar: انشاء حساب جديد

source: Reset Password
ar: اعادة تعين كلمة المرور

# enterEmailForVerification
source: Enter your email for verification
ar: رجاء ادخال بريدك الالكترونى لارسال رمز التحقق

source: Send
ar: ارسال

source: Enter Otp Code
ar: ادخل رمز التحقق

# otpInfoText
source: Enter otp code that sent to your email
ar: رجاء ادخال رمز التحقق الذى تم ارساله على البريد الالكترونى

source: Didn't get otp?
ar: لم يصلك رمز التحقق؟

# pressToResendOtp
source: Press here to resend
ar: اضغط هنا لاعادة الارسال

source: Confirm
ar: تاكيد

source: Welcome
ar: مرحبا

# welcomingPhrase1
source: We are happy to have you
ar: سعداء بانضمامك الينا

# welcomingPhrase2
source: For us to create a customized plan for you we need some data that takes less than a minute.
ar: كى نستطيع وضع خطة تخصص لاجلك نحتاج بعض البيانات التى تستغرق اقل من دقيقة.

source: Start
ar: ابدأ

# later
source: Not now
ar: ليس الان

# personalInfo
source: Personal Information
ar: المعلومات الشخصية

# step
source: Steps
ar: الخطوة

# one
source: first
ar: الاولى

# two
source: Second
ar: الثانية

# three
source: last
ar: الاخيرة

source: Skip
ar: تخطى

source: Are you ?
ar: هل انت ؟

source: Age
ar: السن

source: Height
ar: الطول

source: cm
ar: سم

source: Weight
ar: الوزن

source: What is your goals?
ar: ماهى اهدافك؟

source: Section one
ar: القسم الاول

source: Section two
ar: القسم الثانى

# weightYouWantToTarget
source: What is the weight you want to reach?
ar: ماالوزن الذى تريد الوصول اليه؟

source: kg
ar: كجم

source: Meals you like?
ar: الوجبات التى تفضلها؟

# mealsNotLiked
source: Meals you don't like?
ar: الوجبات التى لا تفضلها؟

source: See more
ar: عرض الكل

source: Number of meals per day?
ar: عدد الوجبات اليومية؟

# mealsVerity
source: Level of variety in the meal?
ar: مستوى التنوع فى الوجبة؟

source: Create My Plan
ar: إنشاء خطتي الخاصة

# focusedBodyPart
source: The part you want to focus on?
ar: الجزء الذى تريد التركيز عليه؟

# trainingTimesPerWeek
source: Number of weekly training times?
ar: عدد مرات التدريب الاسبوعى؟

source: Workout
ar: تمرين

# preferredEquipment
source: What do you prefer in training?
ar: ما الذى تفضله فى التمرين؟

source: Choose Equipments?
ar: اختيار المعدات؟

source: Payment GetWay
ar: الانتقال للدفع

source: Payment
ar: الدفع

source: Payment Failed
ar: فشل في الدفع

source: Payment Successful
ar: تم الدفع بنجاح

source: Discount Details
ar: تفاصيل الخصم

source: Discount Amount
ar: مبلغ الخصم

# homeWelcome
source: Welcome
ar: اهلا

source: You can get
ar: انت تستطيع الوصول

source: Your Perfect Body!
ar: لجسمك المثالي!

# discountOnYourFirstPlan
source: Discount on 1st Plan
ar: خصم لاول خطة

source: Customized for you.
ar: صممت لاجلك.

# dontBeLate
source: Hurry Up &
ar: لا تتاخر و

source: Subscribe now!
ar: اشترك الآن!

# motivationalExerciseTitle
source: Keep going on your fitness journey!
ar: استمر في رحلتك نحو اللياقة!

# motivationalExerciseSubtitle
source: Make every workout a step towards your goal
ar: اجعل كل تمرين خطوة نحو هدفك

# motivationalExerciseAction
source: Start your workout now
ar: ابدأ تمرينك الآن

# motivationalSubscriptionTitle
source: Start your journey to your dream body
ar: ابدأ رحلتك نحو جسم أحلامك

# motivationalSubscriptionSubtitle
source: Get personalized workout and nutrition plans
ar: احصل على خطة تمارين وتغذية مخصصة لك

# motivationalSubscriptionAction
source: Subscribe now
ar: اشترك الآن

source: Goal
ar: الهدف

source: Current Weight
ar: وزنك الحالي

source: Update Weight
ar: تحديث الوزن

source: Today
ar: اليوم

source: Start daily plan customized for you
ar: ابدا رحلتك اليومية بتصفح خطة اليوم المخصصة لك

source: Start Your Exercise
ar: ابدا مهامك

source: Water
ar: مياه

# litre
source: liter
ar: لتر

source: Steps
ar: خطوه

source: km
ar: كم

source: Calories
ar: السعرات

source: Calorie
ar: سعرة

source: Sleep
ar: نوم

source: Hours
ar: ساعات

source: Exercises
ar: التمارين

source: min
ar: دقيقة

source: Home
ar: الرئيسية

source: Exercise
ar: التمارين

source: Nutritions
ar: التغذية

source: Profile
ar: حسابي

# week1
source: First week
ar: الاسبوع الاول

# week2
source: Second week
ar: الاسبوع الثاني

# week3
source: third week
ar: الاسبوع الثالت

# week4
source: fourth week
ar: الاسبوع الرابع

source: Package Ends in
ar: تنتهي الباقه في

source: Today exercise details
ar: تفاصيل تمارين اليوم

source: Exercise Time
ar: مدة التمرين

source: Exercise today will Focus on
ar: تمرين اليوم سوف يركز على

source: What your body needs
ar: ما يحتاجه جسمك اليوم

source: Carbs
ar: كاربوهيدرات

source: Proteins
ar: بروتين

source: Unit
ar: وحدة

source: Breakfast
ar: افطار

source: Lunch
ar: غداء

source: Dinner
ar: عشاء

source: Other Meals
ar: وجبات اخرى

source: My Plan
ar: خطتي

source: Previous Plan
ar: خطتي السابقة

source: Subscribe
ar: اشترك

source: Settings
ar: الاعدادات

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms and Conditions
ar: الشروط والأحكام

source: Logout
ar: تسجيل الخروج

source: Delete Account
ar: حذف الحساب

source: About Us
ar: عن التطبيق

source: Contact Us
ar: تواصل معنا

source: Medical Section
ar: صحتي

source: Soon
ar: قريبا

source: Notification
ar: التنبيهات

source: Sets
ar: المجموعات

source: Time
ar: الوقت

source: Average nutrition gained
ar: معدل ما تم تناوله في الوجبات

source: Average achieved in exercise
ar: معدل ما تم تحقيقة من التمارين

# totalExerciseBurned
source: Total calories burned
ar: معدل ما كان يمكن

source: Renew Subscription
ar: اعادة الاشتراك

source: Congratulations, you have done a great work
ar: تهانينا لقد قمت بعمل رائع

source: Summery of your previous plan
ar: ملخص لخطتك السابقة

source: Started at
ar: بدات في

source: Ended at
ar: آنتهت في

source: Month
ar: شهر

source: SAR
ar: ريال

source: Password is required
ar: يجب ادخال كلمة المرور

source: Password must be at least 6 characters
ar: لا يجب ان تقل كلمة المرور عن 6 احرف

source: Email is required
ar: يجب ادخال البريد الالكترونى

source: Email must be valid
ar: يجب ان يكون البريد الالكترونى صحيح

source: Full name is required
ar: يجب ادخال الاسم كامل

source: Full name must be at least 3 characters
ar: يجب ان لا يقل الاسم عن 3 احرف

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# unverifiedCode
source: Code is unverified
ar: الكود غير صحيح

source: Because we keen to provide an integrated service
ar: ولاننا نحرص على تقديم خدمة متكاملة

source: Wait for
ar: ترقبوا

source: launching
ar: اطلاق

source: Our medical services soon
ar: خدماتنا الصحية قريبًا

source: first Step
ar: الخطوة الاولي

source: Second Step
ar: الخطوة الثانية

source: Third Step
ar: الخطوة الثالثة

source: Let Us Know You Well!
ar: دعنا نتعرف عليك جيدا!

source: Male
ar: ذكر

source: Female
ar: انثى

source: Weight selection is required
ar: يجب تحديد الوزن الذي تريد الوصول اليه

source: Diet type selection is required
ar: يجب تحديد نوع الحمية

# dietType
source: Whats is your diet type?
ar: نوع الحمية الغذائية؟

source: Price after discount
ar: السعر بعد الخصم

source: Price before discount
ar: السعر قبل الخصم

source: Coupon Code
ar: كود الخصم

source: You are already subscribed to this plan
ar: انت مشترك بالفعل في هذه الباقة

source: No Subscription
ar: لا يوجد اشتراك

source: Your Choices
ar: اختياراتك

# myPlanPhrase
source: You can view and change your personal information and goals that have been determined before
ar: تستطيع الاطلاع وتغير معلوماتك الشخصية واهدافك التى تم تحديدها من قبل

source: Week
ar: اسبوع

source: Change Email
ar: تغيير البريد الالكترونى

source: Change Name
ar: تغيير الاسم

# changeEmailPhrase
source: Change your account email.
ar: اعادة تعيين البريد الالكترونى الخاص بك.

# resetPassord
source: Reset Password
ar: اعادة تعين كلمة المرور

# resetPasswordPhrase
source: Reset your password.
ar: اعادة تعين كلمة المرور الخاصة بك.

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Are you sure you want to logout?
ar: هل تريد تسجيل خروج من حسابك الشخصى؟

# areYouSureYouWantToDeleteAccount
source: Are you sure you want to delete your account From Urfit?
ar: هل تريد حذف حسابك على يورفيت؟

source: Yes
ar: نعم

source: No
ar: لا

# weAreHappyToGetYourFeedback
source: We are happy to get your inquiries and messages
ar: نحن سعداء بتلقي رسائلك و استفساراتك

source: Message
ar: الرسالة

source: Please enter your message
ar: رجاء ادخال رسالتك

source: Plan Update
ar: تحديث الخطة

# planUpdatePhrase1
source: Please wait to complete the update of your plan
ar: رجاء الانتظار لاتمام تحديث خطتك الخاصة

# planUpdatePhrase2
source: We are updating your diet and exercise plan based on the information you modified earlier.
ar: نقوم بتحديث خطتك الغذائية والرياضية بناءا على المعلومات التى قمت بتعديلها سابقا .

source: What's your age?
ar: ما هو سنك؟

source: What's your height?
ar: ما هو طولك؟

source: What's your weight?
ar: ما هو وزنك؟

source: Year
ar: سنة

source: Enter age
ar: ادخل السن

source: Enter height
ar: ادخل الطول

source: Enter weight
ar: ادخل الوزن

# trainingTimes
source: Exercise times
ar: عدد التمارين

source: Select All
ar: اختيار الكل

source: Save
ar: حفظ

# heightMustBeBetween
source: Height must be between 100 and 250 cm
ar: الطول يجب أن يكون بين 100 و 250 سم

# weightMustBeBetween
source: Weight must be between 25 and 300 kg
ar: الوزن يجب أن يكون بين 25 و 300 كيلوغرام

# ageMustBeBetween
source: Age must be between 16 and 99 years
ar: العمر يجب أن يكون بين 16 و 99 سنة

# targetWeightMustBeBetween
source: Target weight must be between 25 and 300 kg
ar: الوزن الهدف يجب أن يكون بين 25 و 300 كيلوغرام

# acceptedValuesHeight
source: Accepted values: 100 - 250 cm
ar: القيم المقبولة: 100 - 250 سم

# acceptedValuesWeight
source: Accepted values: 25 - 300 kg
ar: القيم المقبولة: 25 - 300 كيلوغرام

# acceptedValuesAge
source: Accepted values: 16 - 99 years
ar: القيم المقبولة: 16 - 99 سنة

# acceptedValuesTargetWeight
source: Accepted values: 25 - 300 kg
ar: القيم المقبولة: 25 - 300 كيلوغرام

# sportsInfo
source: Sports Information
ar: المعلومات الرياضية

# dietInfo
source: Diet Information
ar: معلومات النظام الغذائي

# medicalInfo
source: Medical Information
ar: المعلومات الطبية

source: Cancel
ar: إلغاء

source: Are you sure you want to cancel?
ar: هل أنت متأكد من أنك تريد الإلغاء؟

source: Sunday
ar: الأحد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

# subscribeToAccessExercises
source: Subscribe to access personalized workouts
ar: اشترك للوصول إلى التمارين المخصصة

# subscribeToAccessMeals
source: Subscribe to access custom meal plans
ar: اشترك للوصول إلى خطط الوجبات المخصصة

# subscribeToAccessAllFeatures
source: Subscribe to access all personalized features
ar: اشترك للوصول إلى جميع الميزات المخصصة
